app/Controllers/Auth/FrontendAuth.php

        $this->setParentSession($user);

        // Update last login
        $this->userModel->update($user->id, ['last_login' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login` = '2026-03-13 13:41:03', `updated_at` = '2026-03-13 13:41:03'
WHERE `users`.`id` IN ('20')