app/Helpers/basic_helper.php

SELECT COUNT(*) AS `numrows`
FROM `role_permissions` `rp`
JOIN `permissions` `p` ON `p`.`id` = `rp`.`permission`
WHERE `rp`.`role` = '1'
AND `p`.`code` = 'users_list'
---
    function hasPermissions($code = '') {
        $db = \Config\Database::connect();
        $builder = $db->table('role_permissions rp');
        $builder->join('permissions p', 'p.id = rp.permission');
        $builder->where('rp.role', logged('role'));
        $builder->where('p.code', $code);
        return $builder->countAllResults() > 0;