app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `booking_status` = 'confirmed'
SELECT SUM(`payment_amount`) AS `payment_amount`
FROM `bookings`
WHERE `payment_status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 3
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 2
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` IN (2,3)
AND   (
`provider_verification_status` = 'pending'
OR `provider_verification_status` = 'submit'
 )
SELECT COUNT(*) AS `numrows`
FROM `listings`
WHERE `review_status` = 'pending'
SELECT SUM(`payment_amount`) AS `payment_amount`
FROM `bookings`
WHERE `payment_status` = 'paid'
AND `created_at` >= '2026-04-01'
SELECT `c`.`name`, COUNT(l.id) as count
FROM `listings` `l`
JOIN `categories` `c` ON `c`.`id` = `l`.`category_id`
GROUP BY `l`.`category_id`
ORDER BY `count` DESC
SELECT DATE(created_at) as date, COUNT(id) as count
FROM `bookings`
WHERE `booking_status` = 'confirmed'
AND `created_at` >= '2026-03-10'
GROUP BY `date`
ORDER BY `date` ASC
SELECT `type`, COUNT(id) as count
FROM `listings`
GROUP BY `type`
---
    public function index()
    {
        $db = \Config\Database::connect();

        // 1. Core Summary Metrics
        $stats = [
            'total_listings' => $db->table('listings')->countAllResults(),
            'total_bookings' => $db->table('bookings')->where('booking_status', 'confirmed')->countAllResults(),
            'total_revenue'  => $db->table('bookings')->where('payment_status', 'paid')->selectSum('payment_amount')->get()->getRow()->payment_amount ?? 0,
            'total_parents'  => $db->table('users')->where('role', 3)->countAllResults(),
            'total_providers'=> $db->table('users')->where('role', 2)->countAllResults(),
            // New metrics
            'pending_kyc'    => $db->table('users')->whereIn('role', [2, 3])->groupStart()->where('provider_verification_status', 'pending')->orWhere('provider_verification_status', 'submit')->groupEnd()->countAllResults(),
            'pending_listings'=> $db->table('listings')->where('review_status', 'pending')->countAllResults(),
        ];

        // 2. Growth Calculation (This month vs Last month)
        $thisMonth = date('Y-m-01');

        $stats['revenue_this_month'] = $db->table('bookings')
            ->where('payment_status', 'paid')
            ->where('created_at >=', $thisMonth)
            ->selectSum('payment_amount')->get()->getRow()->payment_amount ?? 0;

        $stats['users_this_month'] = $db->table('users')
            ->where('created_at >=', $thisMonth)
            ->countAllResults();

        // 3. Category Distribution
        $categoryCounts = $db->table('listings l')
            ->select('c.name, COUNT(l.id) as count')
            ->join('categories c', 'c.id = l.category_id')
            ->groupBy('l.category_id')
            ->orderBy('count', 'DESC')
            ->get()->getResultArray();

        // 4. Booking Trend (Last 30 Days)
        $trendData = $db->table('bookings')
            ->select("DATE(created_at) as date, COUNT(id) as count")
            ->where('booking_status', 'confirmed')
            ->where('created_at >=', date('Y-m-d', strtotime('-30 days')))
            ->groupBy('date')
            ->orderBy('date', 'ASC')
            ->get()->getResultArray();

        // 5. Listing Type Distribution
        $typeStats = $db->table('listings')
            ->select('type, COUNT(id) as count')
            ->groupBy('type')
            ->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `provider_verification_status` IN ('pending','submit')
AND `updated_at` <= '2026-04-07 01:12:32'
---
        $alerts = [];

        // 6.1 Pending KYC > 48 hours
        $kycAlerts = $db->table('users')
            ->whereIn('provider_verification_status', ['pending', 'submit'])
            ->where('updated_at <=', date('Y-m-d H:i:s', strtotime('-48 hours')))
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `settlements`
WHERE `status` = 'pending'
AND `created_at` <= '2026-04-06 01:12:32'
---
        }

        // 6.2 Pending Settlements > 3 days
        $settlementAlerts = $db->table('settlements')
            ->where('status', 'pending')
            ->where('created_at <=', date('Y-m-d H:i:s', strtotime('-3 days')))
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `feedbacks`
WHERE `status` = 'new'
AND `created_at` <= '2026-04-06 01:12:32'
---
        }

        // 6.3 Unresolved Concerns > 72 hours
        $concernAlerts = $db->table('feedbacks')
            ->where('status', 'new')
            ->where('created_at <=', date('Y-m-d H:i:s', strtotime('-72 hours')))
            ->countAllResults();

SELECT `b`.*, `l`.`title` as `listing_title`, `u`.`name` as `parent_name`
FROM `bookings` `b`
LEFT JOIN `listings` `l` ON `l`.`id` = `b`.`listing_id`
LEFT JOIN `users` `u` ON `u`.`id` = `b`.`parent_id`
ORDER BY `b`.`created_at` DESC
 LIMIT 5
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
---
        }

        // 7. Latest Activity
        $latestBookings = $db->table('bookings b')
            ->select('b.*, l.title as listing_title, u.name as parent_name')
            ->join('listings l', 'l.id = b.listing_id', 'left')
            ->join('users u', 'u.id = b.parent_id', 'left')
            ->orderBy('b.created_at', 'DESC')
            ->limit(5)
            ->get()->getResultArray();

        $latestUsers = $db->table('users')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->get()->getResultArray();