app/Controllers/Frontend.php

SELECT *
FROM `listing_images`
WHERE `listing_id` = '5'
ORDER BY `position` ASC
---
    public function index(): string
    {
        $loc = $this->resolveLocation();

        $listingModel    = new ListingModel();
        $carouselService = new CarouselService();

        // ── Featured carousel (smart: admin picks + algo gap-fill) ─
        $slides = $carouselService->getCarouselForState($loc['state']);

        // Normalise floats for view
        $featured_listings = array_map(function ($row) {
            $arr = (array) $row;
            $id  = $arr['listing_id'] ?? ($arr['id'] ?? null);

            if (empty($arr['cover_image']) && $id) {
               $db = \Config\Database::connect();
               $img = $db->table('listing_images')->where('listing_id', $id)->orderBy('position', 'ASC')->get()->getRow();

SELECT *
FROM `categories`
ORDER BY `name` ASC
---
            }
        }

        $categories = (new \App\Models\CategoryModel())->orderBy('name', 'ASC')->findAll();