app/Models/ListingModel.php

    public function logActiveListingStats($lat = null, $lng = null, $type = null, $radius = 25, $catId = null)
    {
        $db = \Config\Database::connect();

        // Normalize args if called with different order
        if (is_string($lat)) {
             // Probably called as ($type, $lat, $lng, $radius, $catId)
             $tmpType = $lat;
             $tmpLat = $lng;
             $tmpLng = $type;
             $tmpRadius = $radius;

             $type = $tmpType;
             $lat = $tmpLat;
             $lng = $tmpLng;
             $radius = $tmpRadius;
        }

        // 1. Total records
        $total = $db->table('listings')->countAllResults();

        // 2. Filter breakdown
        $active   = $db->table('listings')->where('status', 'active')->countAllResults();
        $approved = $db->table('listings')->where('review_status', 'approved')->countAllResults();
        $paid     = $db->table('listings')->where('payment', 'success')->countAllResults();

        $fullyValid = $db->table('listings')
            ->where('status', 'active')
            ->where('review_status', 'approved')
            ->where('payment', 'success')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `listings`
SELECT COUNT(*) AS `numrows`
FROM `listings`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `listings`
WHERE `review_status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `listings`
WHERE `payment` = 'success'
SELECT COUNT(*) AS `numrows`
FROM `listings`
WHERE `status` = 'active'
AND `review_status` = 'approved'
AND `payment` = 'success'