app/Models/TestimonialModel.php

SELECT *
FROM `testimonials`
WHERE `page` = 'home'
AND `status` = 'active'
ORDER BY `position` ASC
---
    public function getForPage(string $page, int $limit = 10)
    {
        return $this->where('page', $page)
                    ->where('status', 'active')
                    ->orderBy('position', 'ASC')
                    ->limit($limit)
                    ->findAll();