app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `phone` = '9989284804'
 LIMIT 1
---
    public function findByPhone(string $phone): ?object
    {
        return $this->where('phone', $phone)->first();